dck982/coffeeflow/firmware/can-monitor/sdkconfig.defaults
# Défauts de projet — adaptateur CAN de secours (M5Stack Atom S3 + Unit CAN).
# Rien de commun avec sensors/screen : ce n'est pas un nœud du protocole,
# juste une sonde flashée une fois. Voir docs/firmware-implementation.md.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN=y
